Repository: giellalt/corpus-nob
Catalog: tmx/smj/admin/sd/samediggi.no/apply_as_an_internship_at_walt_disney_animation_studios_2022.html.tmx
Source language: nob
Languages: smj

source: Apply as an internship at Walt Disney Animation Studios 2022
smj: Åtså hárjjidallen Walt Disney Animation Studion 2022

source: Are you a current or recent student studying art, animation, computer graphics, and film?
smj: Le gus låhkåmin jali ájgo låhkåt dájddagav, animasjåvnåv, dáhtá grafijkav, ja filmav?

source: Walt Disney Animation Studios are inviting students from Sápmi to apply as an internship for the Summer Internship Program in May 2022.
smj: Walt Disney Animation Studios åhtsi hárjjidallijt sijá giesse hárrjidalle prográmmaj mij álgaduvvá moarmesmánon 2022.

source: As a Talent Development intern, you will have the unique opportunity to work directly with a Disney mentor as you explore all aspects of art, storytelling, and filmmaking.
smj: Oassálassten Oajvvás åvddånimprográmman, de dujna l sierralágásj máhtelisvuohta barggat Disney mentåvråjn gå åtsåda gájkka dájddaga, subtsastallama, ja filmmabuvtadime gehtjadimvuogijt.

source: Walt Disney Animation Studios Summer Internship Program is a 10-week program, paid experience designed for students studying art, animation, computer graphics, and film.
smj: Walt Disney Animation Studios Summer Internship Program la 10 váhko mávsedum prográmma hiebadahtedum dajda gudi låhki dájdav, animasjåvnåv, dáhtá, grafijkav ja filmav.

source: Please note, the safety and well-being of our teams is very important to us. We will be determining whether this program will be in-person at our Burbank, CA studio or virtual in the coming months based on government recommendations.
smj: Mierkki sihkarvuohta ja varresvuohta la riek ájnas midjij. Mærrádusá båhti jus prográmma tjadáduvvá mijá lunna Burbank, CA studio jali gájdosåhpadussan oajválattjaj rádij milta.

source: Read more about their internship program and requirements here:
smj: Lågå ienebuv sijá hárjjidallam prográmma ja rávkalvisáj birra dánna:

source: The deadline for applications is 16.01. 2022, 11:59 PM Pacific Standard Time (Notice the time difference).
smj: Åtsålvisá ájggemierre l ådåjakmáno 16. b. 2022, 11:59 PM Pacific Standard Time Time (gehtja ájge sieradusáv).

source: Travel grant
smj: Mannodoarjja

source: The internship form Sámi areas can apply for a 10.000$ travel grant, funded by The Saami Council and the Sámi parliaments.
smj: Hárjjidalle åhtså 10.000 $ mannodoarjjan, majt Sámedigge ja Sáme Parlamænnta la almodam.

source: The applicant must have Sámi background, meets Disney's requirements for internships and should have a plan for how to bring the knowledge back to the Sami community, such as through social media, lectures etc.Write an application, max 1 page, explaining your applicant basis and how to meet our travel grant requirements.
smj: Hárjjidallen galggá liehket sámeduogásj, dievddet Disney rávkalvisájt hárjjidallamijda ja plána gåktu ruoptusbuktet máhttudagáv sáme sebrudahkaj, buojkulvissan sosiála mediaj, lågådallamij jnv. Tjále åtsålvisáv, ienemus avtav bielev, tjielggi åhttsediedojt ja gåktu dævdá mijá mannodårja rávkalvisájt.

source: Send your application for travel grant marked with "WDAS internship” to: kmr@saamicouncil.net .
smj: Rája åtsålvisáv mannodoarjjaj mierkkidum ”WDAS hárjjidalle”: kmr@saamicouncil.net .

source: The deadline for travel applications is 16.01.2022, 11:59 PM Pacific Standard Time (Notice the time difference).
smj: Mannodårja ájggemierre l ådåjakmáno 16. b. 2022, 11:59 PM Pacific Standard Time (gehtja ájge sieradusáv).

source: Contact info
smj: Guládallam diehto
